Model(
  (encoder): Serial(
    (0): Convolution(
      (conv): Conv1d(1, 4, kernel_size=(5,), stride=(1,), padding=(2,))
      (activation): Swish(
        (quant): QuantStub()
        (dequant): DeQuantStub()
      )
    )
    (1): Convolution(
      (conv): Conv1d(4, 16, kernel_size=(5,), stride=(1,), padding=(2,))
      (activation): Swish(
        (quant): QuantStub()
        (dequant): DeQuantStub()
      )
    )
    (2): Convolution(
      (conv): Conv1d(16, 768, kernel_size=(19,), stride=(5,), padding=(9,))
      (activation): Swish(
        (quant): QuantStub()
        (dequant): DeQuantStub()
      )
    )
    (3): Permute(dims=[2, 0, 1])
    (4): LSTM(
      reverse=True
      (rnn): LSTM(768, 768)
    )
    (5): LSTM(
      reverse=False
      (rnn): LSTM(768, 768)
    )
    (6): LSTM(
      reverse=True
      (rnn): LSTM(768, 768)
    )
    (7): LSTM(
      reverse=False
      (rnn): LSTM(768, 768)
    )
    (8): LSTM(
      reverse=True
      (rnn): LSTM(768, 768)
    )
    (9): LinearCRFEncoder(
      n_base=4, state_len=5, scale=5.0, blank_score=2.0, expand_blanks=True
      (linear): Linear(in_features=768, out_features=4096, bias=True)
      (activation): Tanh()
      (quant): QuantStub()
      (dequant): DeQuantStub()
    )
  )
)
Total parameters in model 27008104
